kor_score = 80
eng_score = 75
math_score = 90
sci_score = 95

avg = (kor_score +eng_score + math_score + sci_score) /4


print(f"평균 점수: {avg}")


num = 13
if (num%2==1): a=1
else : a=0
print(a)

num2 = 16
if (num2%2==1): a=1
else : a=0
print(a)


h = "881120-1068234"
print(h[:6])
print(h[7:])

print(h[7])


b= "a:b:c:d"
print(b.replace(':','#'))

list =['우리','끝까지', '힘내요!']
print(' '.join(list))

word = "Hello, world!"
print(word[:5])

print(word[-1])

word = " Hellp, My Beautiful World!"
print(word[-6:])


w='너도 날 좋아할 줄은 몰랐어 어쩌면 좋아 너무나 좋아 꿈만 같아서 나 내 자신을 자꾸 꼬집어봐 너무나 좋아 니가 날 혹시 안 좋아할 까봐 혼자 얼마나 애태운지 몰라 그런데 니가 날 사랑한다니 어머 다시 한번 말해봐 텔미 텔미 테테테테테 텔미 나를 사랑한다고 날 기다려 왔다고 텔미 텔미 테테테테테 텔미 내가 필요하다 말해 말해줘요 텔미 텔미 테테테테테 텔미 자꾸만 듣고싶어 계속 내게 말해줘 텔미 텔미 테테테테테 텔미 꿈이 아니라고 말해 말해줘요 어쩜 내 가슴이 이렇게 뛰니 가슴이 정말 터질것같아 니가 날 볼때면 전기에 감전된 사람처럼 전기가 올라 얼마나 오래 기다린지 몰라 얼마나 오래 꿈꿨는지 몰라 그런데 니가 날 사랑한다니 어머 다시 한 번 말해봐 텔미 텔미 테테테테테 텔미 나를 사랑한다고 날 기다려 왔다고 텔미 텔미 테테테테테 텔미 내가 필요하다 말해 말해줘요 텔미 텔미 테테테테테 텔미 자꾸만 듣고싶어 계속 내게 말해줘 텔미 텔미 테테테테테 텔미 꿈이 아니라고 말해 말해줘요 힛 미 원 타임 베이비 다시한번 (텔미 텔미) 오케이 방금한건 알지만 또한번 (텔미 텔미) 요 계속 말해줘 들어도 들어도 듣고 싶어 어쩜 이런 일이 꿈인가 싶어 (어머) 어머나 좋아서 어쩌나 (다시 한 번 말해봐) 텔미 텔미 텔미 유 원미 원미 원미 투 텔미 텔미 텔미 유 럽 미 투 럽 미 투 얼마나 오래 기다린지 몰라 얼마나 오래 꿈꿨는지 몰라 그런데 니가 날 사랑한다니 어머 다시 한 번 말해봐 텔미 텔미 테테테테테 텔미 나를 사랑한다고 날 기다려 왔다고 텔미 텔미 테테테테테 텔미 내가 필요하다 말해 말해줘요 텔미 텔미 테테테테테 텔미 자꾸만 듣고싶어 계속 내게 말해줘 텔미 텔미 테테테테테 텔미 꿈이 아니라고 말해 말해줘요 텔미 텔미 테테테테테 텔미 테테테테테 텔미'
print(f"'텔미' 단어의 개수 : {w.count('텔미')}")
